In [1]:
import pandas as pd

In [2]:
import pyodbc 
cnxn = pyodbc.connect("Driver={SQL Server Native Client 11.0};"
                      "Server=LAPTOP-D0942MUC\SQLEXPRESS;"
                      "Database=college;"
                      "Trusted_Connection=yes;")

In [3]:
Students=pd.read_sql("SELECT * FROM Students$",cnxn)
Courses = pd.read_sql("SELECT * FROM Courses$",cnxn)
Classrooms = pd.read_sql("SELECT * FROM Classrooms$",cnxn)
Departments = pd.read_sql("SELECT * FROM Departments$",cnxn)
Teachers = pd.read_sql("SELECT * FROM Teachers$",cnxn)
class_courses = pd.merge(Classrooms,Courses,how='outer',on='CourseId')
cls_crs_dep = pd.merge(Departments,class_courses,how = 'left',left_on = 'DepartmentId',right_on = 'DepartmentID')
cls_crs_dep_teach = pd.merge(cls_crs_dep,Teachers,how='inner',on = 'TeacherId')
cls_crs_dep_teach_stud = pd.merge(cls_crs_dep_teach,Students,how='outer',on='StudentId')
data=cls_crs_dep_teach_stud.copy()
data.dropna()
#data[data.CourseName=='Basketball']
#data

,DepartmentId,DepartmentName,CourseId,StudentId,degree,CourseName,DepartmentID,TeacherId,FirstName_x,LastName_x,Gender_x,FirstName_y,LastName_y,Gender_y
0,1.0,English,1.0,202.0,92.031070,English Begginers,1.0,15.0,Conor,Mckittrick,M,Autumn,Major,F
1,2.0,Science,4.0,202.0,73.387328,Mathematics 101,2.0,2.0,Amanda,Dworkin,F,Autumn,Major,F
2,2.0,Science,8.0,202.0,83.563932,Chemistry,2.0,14.0,Jeffrey,Batzel,M,Autumn,Major,F
3,2.0,Science,18.0,202.0,66.109849,R,2.0,17.0,Tanner,Fitzsimons,M,Autumn,Major,F
4,3.0,Arts,20.0,202.0,63.988269,History of Arts,3.0,8.0,Caroline,Knuesel,F,Autumn,Major,F
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
749,4.0,Sport,29.0,105.0,81.810113,Tenis,4.0,24.0,Keegan,Price,M,Hannah,Wilkes,F
750,4.0,Sport,30.0,158.0,76.336776,Swimming,4.0,12.0,Mikayla,Russell,F,Mitchell,Fellhauer,M
751,4.0,Sport,31.0,241.0,82.833593,Gymnastics,4.0,23.0,Maxwell,Romkee,M,Kaitlyn,Tuttle,F
752,4.0,Sport,31.0,262.0,78.336991,Gymnastics,4.0,23.0,Maxwell,Romkee,M,Luke,Van Cleave,M
753,4.0,Sport,31.0,108.0,79.660333,Gymnastics,4.0,23.0,Maxwell,Romkee,M,Kevin,Clifton,M

#### a.	מנהל המכללה ביקש לדעת כמה סטודנטים יש לפי יחידה (מחלקה).

In [4]:
a= data.groupby(data.DepartmentName).StudentId.nunique()
a=a.reset_index()
a.columns = ['Department Name','Students']
a

  Department Name  Students
0            Arts       137
1         English        84
2         Science       200
3           Sport        82

#### b.	המורה באנגלית צריך להתארגן וביקש לדעת כמה סטודנטים יש לו לפי כל קורס שהוא מעביר וסה"כ התלמידים בכל הקורסים שלו.

In [5]:
b= data[data.DepartmentID==1].groupby(data.CourseName).StudentId.nunique()
total_sum=data[data.DepartmentID==1].groupby(data.DepartmentId).nunique().iloc[0,3]

b=b.reset_index()
b.columns=['Course Name','numStudents']
print(b)
print('-----------------------')
print('Total' + "                             " + str(total_sum))

##total_sum=total_sum.reset_index()
##total_sum.columns = ['Total', 'Students']

            Course Name  numStudents
0      Advanced English           24
1     English Begginers           32
2  Proffesional English           38
-----------------------
Total                             84

#### c.	המרכז למדעים רוצה להבין כמה כיתות קטנות (מתחת ל-22) וכמה גדולות צריך עבור קורסים ביחידה (מחלקה) שלו.

In [6]:
c= data[data.DepartmentName=='Science'].groupby(data.CourseName).StudentId.nunique()

c=c.reset_index()
c.columns =['NumClassRooms','Students']

c.loc[c['Students']<22, 'Classize'] = 'Small'
c.loc[c ['Students']>=22 ,'Classize'] = 'Big'
Classroomsize= c.groupby(c.Classize).agg('count').iloc[:,0:1]
print(Classroomsize)

          NumClassRooms
Classize
Big                  10
Small                 6

#### d.	סטודנטית שהיא פעילה פמיניסטית טוענת שהמכללה מעדיפה לקבל יותר גברים מאשר נשים. תבדקו האם הטענה מוצדקת (מבחינת כמותית, לא סטטיסטית).

In [7]:
d=Students.groupby(['Gender']).agg(['count']).iloc[:,0:1]
d

       StudentId
           count
Gender
F            165
M            115

#### e.	באיזה קורסים אחוז הגברים / הנשים הינה מעל 70%?

In [8]:
Total=data[['StudentId']].groupby(data.CourseName).agg('count')
Total

crsbygndr=data.groupby(['CourseName','CourseId','Gender_y']).StudentId.nunique()
crsbygndr.reset_index()

e=pd.merge(crsbygndr,Total,how='left',on='CourseName')
e
e['Gndr_Stud_percent']=(e['StudentId_x']/e['StudentId_y'])*100.0
e=e[e['Gndr_Stud_percent']>70]
e=e.iloc[:,2:3]
e

            Gndr_Stud_percent
CourseName
Sculpture           70.833333
Tenis               72.222222

### f.	בכל אחד מהיחידות (מחלקות), כמה סטודנטים (מספר ואחוזים) עברו עם ציון מעל 80?

In [9]:
Total_students=data.groupby(data.DepartmentName).StudentId.nunique()
#print(Total_students)
#data['over80']=0
#data.loc[((data.DepartmentId==1) & (data.degree>80)),'over80'] = 1
#data.loc[((data.DepartmentId==2) & (data.degree>80)),'over80'] = 1
#data.loc[((data.DepartmentId==3) & (data.degree>80)),'over80'] = 1
#data.loc[((data.DepartmentId==4) & (data.degree>80)),'over80'] = 1
#data
Students_over80=data[data.degree>80].groupby(data.DepartmentName).StudentId.nunique()
f=pd.merge(Total_students,Students_over80,how='inner',on='DepartmentName')
f['percent']=(f['StudentId_y'] / f['StudentId_x'])*100.0
f.reset_index()
f.columns=['TotalStudents','Students over80','Percentover80']
f

                TotalStudents  Students over80  Percentover80
DepartmentName
Arts                      137               61      44.525547
English                    84               40      47.619048
Science                   200              122      61.000000
Sport                      82               39      47.560976

### g.	בכל אחד מהיחידות (מחלקות), כמה סטודנטים (מספר ואחוזים) לא עברו (ציון מתחת ל-60) ?

In [10]:
Total_students=data.groupby(data.DepartmentName).StudentId.nunique()
Students_less60=data[data.degree<60].groupby(data.DepartmentName).StudentId.nunique()
f=pd.merge(Total_students,Students_less60,how='inner',on='DepartmentName')
f['percent']=(f['StudentId_y'] / f['StudentId_x'])*100.0
f.reset_index()
f.columns=['TotalStudents','Students less60','Percentless60']
f

                TotalStudents  Students less60  Percentless60
DepartmentName
Arts                      137                3       2.189781
English                    84                2       2.380952
Science                   200                7       3.500000
Sport                      82                1       1.219512

### h.	תדרגו את המורים לפי ממוצע הציון של הסטודנטים מהגבוהה לנמוך.

In [11]:
data['Teacher']=data['FirstName_x']+data['LastName_x']
h=data[['Teacher','degree']].groupby(['Teacher']).mean().sort_values(by='degree',ascending= False).dropna()
h

                      degree
Teacher
 DarickHess        81.432703
 JordynBaron       80.729494
 HeatherMetcalf    80.440242
 ZacharyHealy      79.365867
 KayleaMonzingo    79.365537
 DanielBland       78.908281
 KeeganPrice       78.814631
 ConorMckittrick   78.699492
 MaxwellRomkee     78.673509
 TerranBeaty       78.495479
 TannerFitzsimons  78.443395
 MackenzieOlsen    78.383348
 ErnestStoyanov    78.316150
 MadisonBatan      77.743575
 KaterinaYoung     77.406852
 MikaylaRussell    77.134323
 AmandaDworkin     76.899881
 KaitlinDelude     76.765296
 JeffreyBatzel     76.737973
 RobertAivazian    76.516464
 CarolineKnuesel   75.955453
 AlexanderWatts    75.668139

### i.	תייצרו Data Frame המראה את הקורסים, היחידות (מחלקות) עליהם משויכים, המרצה בכל קורס ומספר התלמידים רשומים בקורס

In [27]:
i=data.groupby(['CourseId','CourseName','DepartmentName','Teacher']).FirstName_y.nunique().reset_index()
i
#StudentId.nunique()

,CourseId,CourseName,DepartmentName,Teacher,FirstName_y
0,1.0,English Begginers,English,ConorMckittrick,32
1,2.0,Advanced English,English,ConorMckittrick,24
2,3.0,Proffesional English,English,ConorMckittrick,35
3,4.0,Mathematics 101,Science,AmandaDworkin,17
4,5.0,Matematics Advanced,Science,AlexanderWatts,10
5,6.0,Algebra,Science,AlexanderWatts,12
6,7.0,Geometry,Science,AlexanderWatts,13
7,8.0,Chemistry,Science,JeffreyBatzel,22
8,9.0,Physics,Science,AlexanderWatts,12
9,10.0,Biology,Science,JordynBaron,34
10,11.0,Genetics,Science,TerranBeaty,37
11,12.0,Neurobiology,Science,TerranBeaty,23
12,13.0,Statistics,Science,HeatherMetcalf,24
13,14.0,Computer Science,Science,KayleaMonzingo,37
14,15.0,Data Science,Science,MackenzieOlsen,29
15,16.0,SQL,Science,ZacharyHealy,23
16,17.0,Python,Science,TerranBeaty,22
17,18.0,R,Science,TannerFitzsimons,32
18,19.0,Java,Science,DarickHess,16
19,20.0,History of Arts,Arts,CarolineKnuesel,31
20,21.0,Painting,Arts,KaterinaYoung,31
21,22.0,Sculpture,Arts,RobertAivazian,23
22,23.0,Musicology,Arts,MadisonBatan,28
23,24.0,Theater,Arts,ErnestStoyanov,26
24,25.0,Literature,Arts,DanielBland,37
25,26.0,Basketball,Sport,KatherineDibari,0
26,27.0,Volleyball,Sport,KaitlinDelude,35
27,28.0,Football,Sport,CortneeKinderknecht,0
28,29.0,Tenis,Sport,KeeganPrice,17
29,30.0,Swimming,Sport,MikaylaRussell,18
30,31.0,Gymnastics,Sport,MaxwellRomkee,21

###  j.	תייצרו Data Frame המראה את התלמידים, מס' הקורסים שהם לוקחים,הממוצע של הציונים לפי יחידה (מחלקה) והממוצע הכוללת שלהם.

In [40]:
j=pd.merge(Students,Classrooms,how='outer',on='StudentId')
j=pd.merge(j, Courses, how='outer',on= 'CourseId')
df_cnt_crs= j.groupby(['StudentId','FirstName','LastName']).CourseId.nunique()

df_j =df_cnt_crs.reset_index()
df_j.columns=['StudentId','FirstName','LastName','Count courses']

df_English = j[j['DepartmentID']==1]
df_Mean_English= df_English.groupby(['StudentId'])['degree'].mean().reset_index()
df_Mean_English.columns=['StudentId','EnglishDegree']
df_j=pd.merge(df_j,df_Mean_English,how='outer', on='StudentId')

df_Arts = j[j['DepartmentID']==3]
df_Mean_Arts= df_Arts.groupby(['StudentId'])['degree'].mean().reset_index()
df_Mean_Arts.columns=['StudentId','ArtsDegree']
df_j=pd.merge(df_j,df_Mean_Arts,how='outer', on='StudentId')

df_Science = j[j['DepartmentID']==2]
df_Mean_Science= df_Science.groupby(['StudentId'])['degree'].mean().reset_index()
df_Mean_Science.columns=['StudentId','ScienceDegree']
df_j=pd.merge(df_j,df_Mean_Science,how='outer', on='StudentId')

df_Sport = j[j['DepartmentID']==4]
df_Mean_Sport= df_Sport.groupby(['StudentId'])['degree'].mean().reset_index()
df_Mean_Sport.columns=['StudentId','SportDegree']
df_j=pd.merge(df_j,df_Mean_Sport,how='outer', on='StudentId')


df_Mean_General = j.groupby(['StudentId'])['degree'].mean().reset_index()
df_Mean_General.columns=['StudentId','GeneralDegree']
df_j=pd.merge(df_j,df_Mean_General,how='outer', on='StudentId')
df_j

,StudentId,FirstName,LastName,Count courses,EnglishDegree,ArtsDegree,ScienceDegree,SportDegree,GeneralDegree
0,1.0,Alexandria,Heller,4,NaN,86.677535,79.557508,NaN,81.337515
1,2.0,Cassie,Liska,5,NaN,79.542738,78.867115,NaN,79.137364
2,3.0,Hayley,Frank,3,83.972245,NaN,76.204427,NaN,78.793700
3,4.0,Maxwell,Kotch,3,70.929801,69.356144,74.157066,NaN,71.481003
4,5.0,Dylan,Boehm,3,NaN,64.494845,100.000000,65.661106,76.718650
...,...,...,...,...,...,...,...,...,...
275,276.0,Dylan,Bannister,3,NaN,NaN,76.784735,NaN,76.784735
276,277.0,Bryan,Medina,6,NaN,78.849330,81.298837,NaN,80.482335
277,278.0,Sydney,Blas,3,NaN,NaN,72.578017,76.749775,75.359189
278,279.0,Samantha,Berend,1,NaN,NaN,NaN,NaN,NaN
279,280.0,Matthew,Mcgrath,4,NaN,77.237998,75.696576,NaN,76.621429